# Day 13 - Pandas Part-2

### Filtering Data from String In different ways

In [1]:
import pandas as pd
data = {
    "Name" : ["Nabil", "Nafis", "Towa", "Riyan", "Rayhan", "Hiya"],
    "Age" : [23, 16, 6, 9, 15, 24],
    "City" : ["York New", "Los Angeles", "New Jersey", "Chicago", "The new Delhi", "Boston"],
    "Salary" : [50000, 82000, 65000, 47000, 58000, 49000 ]
}

df = pd.DataFrame(data)
df

     Name  Age           City  Salary
0   Nabil   23       York New   50000
1   Nafis   16    Los Angeles   82000
2    Towa    6     New Jersey   65000
3   Riyan    9        Chicago   47000
4  Rayhan   15  The new Delhi   58000
5    Hiya   24         Boston   49000

In [8]:
# Finding "New" anywhere from a column or city ,,, case sensitive

df.loc[df['City'].str.contains("New")]

    Name  Age        City  Salary
0  Nabil   23    York New   50000
2   Towa    6  New Jersey   65000

In [9]:
# character case doesn't matter

df.loc[df['City'].str.contains("new", case= False)]

     Name  Age           City  Salary
0   Nabil   23       York New   50000
2    Towa    6     New Jersey   65000
4  Rayhan   15  The new Delhi   58000

### Regular expression
Regular expression is used for efficient text processing.

In [10]:
# city starts with "New" only

df.loc[df['City'].str.contains(r"^New")]

   Name  Age        City  Salary
2  Towa    6  New Jersey   65000

In [11]:
# name ends with "an" only

df.loc[df['Name'].str.contains(r"an$")]

     Name  Age           City  Salary
3   Riyan    9        Chicago   47000
4  Rayhan   15  The new Delhi   58000

In [12]:
# name ends with a vowel only

df.loc[df['Name'].str.contains(r"[aeiou]$")]

   Name  Age        City  Salary
2  Towa    6  New Jersey   65000
5  Hiya   24      Boston   49000

In [13]:
# Multiple filtering (contains new or los)

df.loc[df['City'].str.contains(r"New|Los", case=False)]

     Name  Age           City  Salary
0   Nabil   23       York New   50000
1   Nafis   16    Los Angeles   82000
2    Towa    6     New Jersey   65000
4  Rayhan   15  The new Delhi   58000

### Adding new columns / features

In [86]:
df = pd.read_csv('D14-1_student_completed_data.csv')
df.head()

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna
1,PH0002,Fatima Akhter,98.0,98.0,NaN,Completed,8/11/2024,Mr. Karim,Dhaka
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet

In [20]:
# Adding a column with constant value
df['Country'] = 'Bangladesh'
df.head()

# Adding column with another columns
df['Total marks'] = df['DS marks'] + df['Algo marks'] + df['Python marks']
df.head()

# create column with condition
df['Passed in Algo'] = df['Algo marks'] > 70
df.head()

# new column by adding values of another column using numpy
import numpy as np
df['A+ in DS'] = np.where(df['DS marks'] > 90, 'A+', 'A')
df.tail()

# extract first name from full name

df['First name'] = df['FullName'].str.split(' ').str[0]
df.head()

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country,Total marks,Passed in Algo,A+ in DS,First name
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna,Bangladesh,206.0,False,A,Alif
1,PH0002,Fatima Akhter,98.0,98.0,NaN,Completed,8/11/2024,Mr. Karim,Dhaka,Bangladesh,NaN,True,A+,Fatima
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka,Bangladesh,239.0,True,A,Imran
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna,Bangladesh,215.0,True,A,Jannatul
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet,Bangladesh,227.0,False,A,Kamal

In [21]:
# save data in main file / internal save

df.to_csv('D14-2_new_data.csv')
df = pd.read_csv('D14-2_new_data.csv')
df.tail()

,Unnamed: 0,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country,Total marks,Passed in Algo,A+ in DS,First name
15,15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,3/23/2024,Ms. Salma,Rajshahi,Bangladesh,257.0,True,A,Ziaur
16,16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,1/18/2024,Mr. David,Khulna,Bangladesh,256.0,True,A,Afsana
17,17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,6/23/2024,Mr. David,Dhaka,Bangladesh,259.0,True,A+,Babul
18,18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,4/19/2024,Mr. Karim,Sylhet,Bangladesh,274.0,True,A+,Faria
19,19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,7/21/2024,Mr. Karim,Khulna,Bangladesh,247.0,True,A,Tariq

### Unique and nunique

In [45]:
# Check Unique data in column
df['DS marks'].unique()                # show unique values with null values too
len(df['DS marks'].unique())           # count uniques with null values
df['DS marks'].nunique()               # count uniques without null values

# unique works on only series,, (column/row)
# but nunique can works on whole data frame/df

df.nunique()

Unnamed: 0          20
StudentID           20
FullName            20
DS marks            17
Algo marks          17
Python marks        15
CompletionStatus     1
EnrollmentDate      19
Instructor           3
Location             5
Country              1
Total marks         15
Passed in Algo       2
A+ in DS             2
First name          20
dtype: int64

### Check Null

In [42]:
df['DS marks'].isnull()  # return true / false for null value in series
df.isnull()              # return true / false for null value in df
df.notnull()             # Opposite of previous one
df['DS marks'].hasnans   # is there any null value available in this series? only works for seris, not df

True

### Handling Duplicate values

In [59]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "Alice", "David", "Bob"],
    "City": ["New York", "London", "Tokyo", "New York", "Tokyo", "London"],
    "Score": [85, 90, 78, 95, 95, 90]
}

df1 = pd.DataFrame(data)
df1

      Name      City  Score
0    Alice  New York     85
1      Bob    London     90
2  Charlie     Tokyo     78
3    Alice  New York     95
4    David     Tokyo     95
5      Bob    London     90

In [50]:
df1.duplicated()       # here duplicate counted in same rows
df1.duplicated().sum()  # return how many duplicate values are there

np.int64(1)

In [55]:
# Delete duplicate values
df1.drop_duplicates()                   # removed row 5 and returned a copy,, main file not effected
df1.drop_duplicates(inplace= True)      # removed row 5 permanently from main file and dont return anything
df1

      Name      City  Score
0    Alice  New York     85
1      Bob    London     90
2  Charlie     Paris     78
3    Alice  New York     95
4    David     Tokyo     95

In [68]:
# delete according any column name,, if i want to remove duplicate names
df1.drop_duplicates(subset='Name')
df1.drop_duplicates(subset='Name', keep='last')       # last value of duplicate will remain
df1.drop_duplicates(subset=['Name', 'City'])          # for multiple attributes like duplicate name and city

      Name      City  Score
2  Charlie     Tokyo     78
3    Alice  New York     95
4    David     Tokyo     95
5      Bob    London     90

### Handling Null Values

In [83]:
# Data delete / remove null values

df
df.dropna()             # return a copy and remove all the rows that have even a single null value
df.dropna(how='all', inplace = True)    # it delete row when there is null in all values of the row,, default is how='any'
df.dropna(subset=['DS marks'])          # only delete row if DS marks is null
df.dropna(subset=['DS marks', 'Python marks'])          # can customisable by any column

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet
5,PH0006,Laila Begum,88.0,88.0,84.0,Completed,9/7/2024,Mr. David,Khulna
6,PH0007,Mahmudul Hasan,82.0,82.0,76.0,Completed,6/7/2024,Mr. David,Chattogram
8,PH0009,Omar Faruq,77.0,77.0,92.0,Completed,2/12/2024,Mr. Karim,Dhaka
9,PH0010,Priya Sharma,83.0,83.0,94.0,Completed,6/19/2024,Mr. David,Dhaka
12,PH0013,Tanvir Ahmed,72.0,72.0,51.0,Completed,6/7/2024,Mr. David,Dhaka
13,PH0014,Urmi Akter,65.0,65.0,83.0,Completed,1/4/2024,Mr. David,Sylhet
14,PH0015,Wahiduzzaman,70.0,70.0,96.0,Completed,2/22/2024,Mr. David,Rajshahi
15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,3/23/2024,Ms. Salma,Rajshahi
16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,1/18/2024,Mr. David,Khulna
17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,6/23/2024,Mr. David,Dhaka
18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,4/19/2024,Mr. Karim,Sylhet
19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,7/21/2024,Mr. Karim,Khulna

In [101]:
# Data fill / replace null value

df.fillna(0)         # Null marks filled by zero
df['FullName'].fillna('Unknown')       # changing single column null value
df['DS marks'].fillna(df['DS marks'].mean())             # changing single column null value
df.fillna({'FullName': 'Unknown', 'Python marks': 100})  # (, inplace=True) different null values change

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna
1,PH0002,Fatima Akhter,98.0,98.0,100.0,Completed,8/11/2024,Mr. Karim,Dhaka
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet
5,PH0006,Laila Begum,88.0,88.0,84.0,Completed,9/7/2024,Mr. David,Khulna
6,PH0007,Mahmudul Hasan,82.0,82.0,76.0,Completed,6/7/2024,Mr. David,Chattogram
7,PH0008,Nadia Islam,NaN,NaN,79.0,Completed,3/22/2024,Ms. Salma,Khulna
8,PH0009,Omar Faruq,77.0,77.0,92.0,Completed,2/12/2024,Mr. Karim,Dhaka
9,PH0010,Priya Sharma,83.0,83.0,94.0,Completed,6/19/2024,Mr. David,Dhaka
10,PH0011,Rahim Sheikh,91.0,91.0,100.0,Completed,3/14/2024,Mr. Karim,Sylhet
11,PH0012,Sadia Chowdhury,NaN,NaN,69.0,Completed,8/4/2024,Mr. Karim,Sylhet
12,PH0013,Tanvir Ahmed,72.0,72.0,51.0,Completed,6/7/2024,Mr. David,Dhaka
13,PH0014,Urmi Akter,65.0,65.0,83.0,Completed,1/4/2024,Mr. David,Sylhet
14,PH0015,Wahiduzzaman,70.0,70.0,96.0,Completed,2/22/2024,Mr. David,Rajshahi
15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,3/23/2024,Ms. Salma,Rajshahi
16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,1/18/2024,Mr. David,Khulna
17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,6/23/2024,Mr. David,Dhaka
18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,4/19/2024,Mr. Karim,Sylhet
19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,7/21/2024,Mr. Karim,Khulna
20,NaN,Unknown,NaN,NaN,100.0,NaN,NaN,NaN,NaN

### Statistical Functions in Pandas

In [119]:
df.dropna()                # removed null value wala column
df['DS marks'].sum()       # sum of a column
df['DS marks'].mean()       # average of a column
df['DS marks'].mod(2)      # gives remainder when divided by 2
df['DS marks'].max()       # max in a column
df['DS marks'].min()       # min in a column
df['DS marks'].median()       # moddhok of a column
df['Python marks'].mode()       # highest frequency of number(jei jei number maximum time ache)
df['DS marks'].std()          # standard deviation (how spread out the data in a set is from its average)
df[['DS marks', 'Python marks']].corr()      # Correlation matrix

              DS marks  Python marks
DS marks      1.000000     -0.176771
Python marks -0.176771      1.000000

In [126]:
df.dropna()  
df[['DS marks', 'Algo marks', 'Python marks']].sum(axis=1)    # DS+Algo+Python = total marks
df['Total Marks'] = df.iloc[::,2:5].sum(axis=1)
df.describe()

        DS marks  Algo marks  Python marks  Total Marks
count  18.000000   18.000000     18.000000    21.000000
mean   81.055556   81.055556     79.888889   207.428571
std    11.106290   11.106290     12.237305    71.920492
min    59.000000   59.000000     51.000000     0.000000
25%    72.750000   72.750000     70.750000   196.000000
50%    82.500000   82.500000     83.500000   236.000000
75%    88.750000   88.750000     88.750000   256.000000
max    98.000000   98.000000     96.000000   274.000000

### Apply function on df

In [129]:
# min max data scaling using the apply function

mn = df['Total Marks'].min() 
mx = df['Total Marks'].max() 

df['Scaled Marks'] = df['Total Marks'].apply(lambda x : (x-mn)/(mx-mn))  
df

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location,Total Marks,Scaled Marks
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna,206.0,0.751825
1,PH0002,Fatima Akhter,98.0,98.0,NaN,Completed,8/11/2024,Mr. Karim,Dhaka,196.0,0.715328
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka,239.0,0.872263
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna,215.0,0.784672
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet,227.0,0.828467
5,PH0006,Laila Begum,88.0,88.0,84.0,Completed,9/7/2024,Mr. David,Khulna,260.0,0.948905
6,PH0007,Mahmudul Hasan,82.0,82.0,76.0,Completed,6/7/2024,Mr. David,Chattogram,240.0,0.875912
7,PH0008,Nadia Islam,NaN,NaN,79.0,Completed,3/22/2024,Ms. Salma,Khulna,79.0,0.288321
8,PH0009,Omar Faruq,77.0,77.0,92.0,Completed,2/12/2024,Mr. Karim,Dhaka,246.0,0.897810
9,PH0010,Priya Sharma,83.0,83.0,94.0,Completed,6/19/2024,Mr. David,Dhaka,260.0,0.948905
10,PH0011,Rahim Sheikh,91.0,91.0,NaN,Completed,3/14/2024,Mr. Karim,Sylhet,182.0,0.664234
11,PH0012,Sadia Chowdhury,NaN,NaN,69.0,Completed,8/4/2024,Mr. Karim,Sylhet,69.0,0.251825
12,PH0013,Tanvir Ahmed,72.0,72.0,51.0,Completed,6/7/2024,Mr. David,Dhaka,195.0,0.711679
13,PH0014,Urmi Akter,65.0,65.0,83.0,Completed,1/4/2024,Mr. David,Sylhet,213.0,0.777372
14,PH0015,Wahiduzzaman,70.0,70.0,96.0,Completed,2/22/2024,Mr. David,Rajshahi,236.0,0.861314
15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,3/23/2024,Ms. Salma,Rajshahi,257.0,0.937956
16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,1/18/2024,Mr. David,Khulna,256.0,0.934307
17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,6/23/2024,Mr. David,Dhaka,259.0,0.945255
18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,4/19/2024,Mr. Karim,Sylhet,274.0,1.000000
19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,7/21/2024,Mr. Karim,Khulna,247.0,0.901460
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.000000

In [132]:
# Custom function create
def grade(marks):
    if marks>=260:
        return 'A+'
    elif marks >=240:
        return 'A'
    elif marks >= 220:
        return 'B'
    elif marks >= 200:
        return 'C'
    else:
        return 'F'

df['Grade'] = df['Total Marks'].apply(grade)
df

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location,Total Marks,Scaled Marks,Grade
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna,206.0,0.751825,C
1,PH0002,Fatima Akhter,98.0,98.0,NaN,Completed,8/11/2024,Mr. Karim,Dhaka,196.0,0.715328,F
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka,239.0,0.872263,B
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna,215.0,0.784672,C
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet,227.0,0.828467,B
5,PH0006,Laila Begum,88.0,88.0,84.0,Completed,9/7/2024,Mr. David,Khulna,260.0,0.948905,A+
6,PH0007,Mahmudul Hasan,82.0,82.0,76.0,Completed,6/7/2024,Mr. David,Chattogram,240.0,0.875912,A
7,PH0008,Nadia Islam,NaN,NaN,79.0,Completed,3/22/2024,Ms. Salma,Khulna,79.0,0.288321,F
8,PH0009,Omar Faruq,77.0,77.0,92.0,Completed,2/12/2024,Mr. Karim,Dhaka,246.0,0.897810,A
9,PH0010,Priya Sharma,83.0,83.0,94.0,Completed,6/19/2024,Mr. David,Dhaka,260.0,0.948905,A+
10,PH0011,Rahim Sheikh,91.0,91.0,NaN,Completed,3/14/2024,Mr. Karim,Sylhet,182.0,0.664234,F
11,PH0012,Sadia Chowdhury,NaN,NaN,69.0,Completed,8/4/2024,Mr. Karim,Sylhet,69.0,0.251825,F
12,PH0013,Tanvir Ahmed,72.0,72.0,51.0,Completed,6/7/2024,Mr. David,Dhaka,195.0,0.711679,F
13,PH0014,Urmi Akter,65.0,65.0,83.0,Completed,1/4/2024,Mr. David,Sylhet,213.0,0.777372,C
14,PH0015,Wahiduzzaman,70.0,70.0,96.0,Completed,2/22/2024,Mr. David,Rajshahi,236.0,0.861314,B
15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,3/23/2024,Ms. Salma,Rajshahi,257.0,0.937956,A
16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,1/18/2024,Mr. David,Khulna,256.0,0.934307,A
17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,6/23/2024,Mr. David,Dhaka,259.0,0.945255,A
18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,4/19/2024,Mr. Karim,Sylhet,274.0,1.000000,A+
19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,7/21/2024,Mr. Karim,Khulna,247.0,0.901460,A
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.000000,F

In [133]:
# Custom fucntion in df
def Multiple_marks(df):
    a = df['DS marks'] * 2
    b = df['Algo marks'] * 3
    c = df['Python marks'] * 4
    return a+b+c

df['Magic Marks'] = df.apply(Multiple_marks, axis=1)
df

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location,Total Marks,Scaled Marks,Grade,Magic Marks
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna,206.0,0.751825,C,647.0
1,PH0002,Fatima Akhter,98.0,98.0,NaN,Completed,8/11/2024,Mr. Karim,Dhaka,196.0,0.715328,F,NaN
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka,239.0,0.872263,B,701.0
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna,215.0,0.784672,C,635.0
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet,227.0,0.828467,B,701.0
5,PH0006,Laila Begum,88.0,88.0,84.0,Completed,9/7/2024,Mr. David,Khulna,260.0,0.948905,A+,776.0
6,PH0007,Mahmudul Hasan,82.0,82.0,76.0,Completed,6/7/2024,Mr. David,Chattogram,240.0,0.875912,A,714.0
7,PH0008,Nadia Islam,NaN,NaN,79.0,Completed,3/22/2024,Ms. Salma,Khulna,79.0,0.288321,F,NaN
8,PH0009,Omar Faruq,77.0,77.0,92.0,Completed,2/12/2024,Mr. Karim,Dhaka,246.0,0.897810,A,753.0
9,PH0010,Priya Sharma,83.0,83.0,94.0,Completed,6/19/2024,Mr. David,Dhaka,260.0,0.948905,A+,791.0
10,PH0011,Rahim Sheikh,91.0,91.0,NaN,Completed,3/14/2024,Mr. Karim,Sylhet,182.0,0.664234,F,NaN
11,PH0012,Sadia Chowdhury,NaN,NaN,69.0,Completed,8/4/2024,Mr. Karim,Sylhet,69.0,0.251825,F,NaN
12,PH0013,Tanvir Ahmed,72.0,72.0,51.0,Completed,6/7/2024,Mr. David,Dhaka,195.0,0.711679,F,564.0
13,PH0014,Urmi Akter,65.0,65.0,83.0,Completed,1/4/2024,Mr. David,Sylhet,213.0,0.777372,C,657.0
14,PH0015,Wahiduzzaman,70.0,70.0,96.0,Completed,2/22/2024,Mr. David,Rajshahi,236.0,0.861314,B,734.0
15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,3/23/2024,Ms. Salma,Rajshahi,257.0,0.937956,A,761.0
16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,1/18/2024,Mr. David,Khulna,256.0,0.934307,A,766.0
17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,6/23/2024,Mr. David,Dhaka,259.0,0.945255,A,742.0
18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,4/19/2024,Mr. Karim,Sylhet,274.0,1.000000,A+,820.0
19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,7/21/2024,Mr. Karim,Khulna,247.0,0.901460,A,748.0
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,0.000000,F,NaN

### Date time in Pandas

In [20]:
df = pd.read_csv('D14-1_student_completed_data.csv')          # this is an object now
df.dropna(how='all', inplace = True) 
df['EnrollmentDate'] = pd.to_datetime(df['EnrollmentDate'])     # converting to pandas datetime data
df['EnrollmentDate']
df['Enroll Year'] = df['EnrollmentDate'].dt.year                # extracting year (month, day) possible
df['Total time taken to finish']= df['FinishedDate'] - df['EnrollmentDate']  # total koto din oita difference show krbe,, day te
df

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location,Enroll Year
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,2024-09-01,Ms. Salma,Khulna,2024
1,PH0002,Fatima Akhter,98.0,98.0,NaN,Completed,2024-08-11,Mr. Karim,Dhaka,2024
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,2024-05-08,Ms. Salma,Dhaka,2024
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,2024-07-05,Mr. Karim,Khulna,2024
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2024-02-01,Mr. David,Sylhet,2024
5,PH0006,Laila Begum,88.0,88.0,84.0,Completed,2024-09-07,Mr. David,Khulna,2024
6,PH0007,Mahmudul Hasan,82.0,82.0,76.0,Completed,2024-06-07,Mr. David,Chattogram,2024
7,PH0008,Nadia Islam,NaN,NaN,79.0,Completed,2024-03-22,Ms. Salma,Khulna,2024
8,PH0009,Omar Faruq,77.0,77.0,92.0,Completed,2024-02-12,Mr. Karim,Dhaka,2024
9,PH0010,Priya Sharma,83.0,83.0,94.0,Completed,2024-06-19,Mr. David,Dhaka,2024
10,PH0011,Rahim Sheikh,91.0,91.0,NaN,Completed,2024-03-14,Mr. Karim,Sylhet,2024
11,PH0012,Sadia Chowdhury,NaN,NaN,69.0,Completed,2024-08-04,Mr. Karim,Sylhet,2024
12,PH0013,Tanvir Ahmed,72.0,72.0,51.0,Completed,2024-06-07,Mr. David,Dhaka,2024
13,PH0014,Urmi Akter,65.0,65.0,83.0,Completed,2024-01-04,Mr. David,Sylhet,2024
14,PH0015,Wahiduzzaman,70.0,70.0,96.0,Completed,2024-02-22,Mr. David,Rajshahi,2024
15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,2024-03-23,Ms. Salma,Rajshahi,2024
16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,2024-01-18,Mr. David,Khulna,2024
17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,2024-06-23,Mr. David,Dhaka,2024
18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,2024-04-19,Mr. Karim,Sylhet,2024
19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,2024-07-21,Mr. Karim,Khulna,2024

### Group by

In [28]:
grp = df.groupby('Instructor')           # instructor e basis e group kora hoyeche
grp.max()                            # group er mjhe max value
grp.min()                            # group er mjhe min value
grp.first()                            # group er mjhe first value
grp.last()                            # group er mjhe last value

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Location,Enroll Year
Instructor,,,,,,,,,
Mr. David,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,2024-06-23,Dhaka,2024
Mr. Karim,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,2024-07-21,Khulna,2024
Ms. Salma,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,2024-03-23,Rajshahi,2024

### https://leetcode.com/problems/delete-duplicate-emails/

In [30]:
# solution

import pandas as pd

def delete_duplicate_emails(person: pd.DataFrame) -> None:
    person.sort_values('id', inplace = True)
    person.drop_duplicates('email', inplace = True)

### https://leetcode.com/problems/count-salary-categories/description/

In [ ]:
import pandas as pd

def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    low_sal = (accounts['income']<20000).sum()
    avg_sal = ((accounts['income']>=20000) & (accounts['income']<=50000)).sum()
    high_sal = (accounts['income']>50000).sum()

    data = [('Low Salary', low_sal), ('Average Salary', avg_sal), ('High Salary', high_sal)]

    df = pd.DataFrame(data, columns=['category', 'accounts_count'])

    return df